{ ********************************************************************* }
{ функции для работы с FIFO буфером АЦП и ЦАП на плате E-440,				}
{ 							на которой может быть установлен только ADSP-2185	}
{ ********************************************************************* }

{ !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!	}
{ *********************************************************************	}
{  Команда конфигурирования FIFO буфера АЦП 										}
{ 	 значение адреса FIFO может быть равно только 0x0 в памяти данных		}
{	 значение длины FIFO в диапазоне от 64 (0x40) до 12288 (0x3000) Слов	}
{ *********************************************************************	}
CheckAdcFifoLimits:
	PutValPm(AR, 0x0, AdcFifoBaseAddressAddr);	{ базовый адрес FIFO АЦП	}

	GetPm(AR, AdcFifoLengthAddr);
	AY0 = 0x40;							{ минимально возможная длина FIFO АЦП	}
	NONE = AR-AY0;
	IF GE JUMP CheckMaxAdcFifoLength;
	PutPm(AY0, CurAdcFifoLengthAddr);
	RTS;

CheckMaxAdcFifoLength:
	AY0 = 0x3000;	 	  				{ максимально возможная длина FIFO АЦП	}
	NONE = AR-AY0;
	IF GT AR = PASS AY0;
	PutPm(AR, CurAdcFifoLengthAddr);

{ спокойно выходим из функции															}
	RTS;

{ !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!	}
{ ********************************************************************* }
{  Функция конфигурирования FIFO буфера ЦАП 										}
{   значение адреса FIFO может быть равно только 0x3000 в памяти данных	}
{	 значение длины FIFO в диапазоне от 64 (0x40) до 4032 (0xFC0) Слов	}
{ ********************************************************************* }
CheckDacFifoLimits:
	PutValPm(AR, 0x3000, DacFifoBaseAddressAddr);	{ базовый адрес FIFO ЦАП}

	GetPm(AR, DacFifoLengthAddr);	{ нужная длина FIFO ЦАП						}
	AY0 = 0x40;							{ минимально возможная длина FIFO ЦАП	}
	NONE = AR-AY0;
	IF GE JUMP CheckMaxDacFifoLength;
	AR = PASS AY0;
	PutPm(AR, CurDacFifoLengthAddr);
	RTS;

CheckMaxDacFifoLength:
	AY0 = 0xFC0;						{ максимально возможная длина FIFO ЦАП	}
	NONE = AR-AY0;
	IF GT AR= PASS AY0;
	PutPm(AR, CurDacFifoLengthAddr);	{ установленная длина FIFO ЦАП	}

{ спокойно выходим из функции															}
	RTS;
