{ ---------------------------------------------------------------------	}
{	Функции для работы цифровыми линиями											}
{ ---------------------------------------------------------------------	}

{ *********************************************************************	}
{ Команда разрешения/запрещения работы с TTL выходами							}
{ *********************************************************************	}
Enable_TTL_Out_cmd:
{ установим требуемое состояние доступности TTL выходов						}
	CALL Enable_TTL_Out;
{ штатное завершение выполнения команды											}
	JUMP EndOfCommand;

{ *********************************************************************	}
{ Команда приема с цифровых входных линий											}
{ *********************************************************************	}
Get_TTL_cmd:
	AR = IO(TTL_IN); PutPm(AR, TtlInAddr);
{ штатное завершение выполнения команды											}
	JUMP EndOfCommand;

{ *********************************************************************	}
{ Команда управления цифровыми выходными линиями								}
{ *********************************************************************	}
Put_TTL_cmd:
{ Функция управления состояниями цифровых выходных линий						}
	CALL Put_TTL;
{ штатное завершение выполнения команды											}
	JUMP EndOfCommand;

{ *********************************************************************	}
{ Функция разрешения/запрещения работы с TTL выходами							}
{ *********************************************************************	}
Enable_TTL_Out:
	GetPm(AY0, EnableTtlOutAddr);
	AR = DM(Prog_Flag_Data);	{ считаем флаги PFx								}
	AR = SETBIT 0 OF AR;
	NONE = PASS AY0;
	IF NE AR = CLRBIT 0 OF AR;
	DM(Prog_Flag_Data) = AR;	{ 	выводим TTL OUT из третьего состояния	}

{ спокойненько выходим из функции													}
	RTS;

{ *********************************************************************	}
{ Функция управления состояниями цифровых выходных линий						}
{ *********************************************************************	}
Put_TTL:
	GetPm(AR, TtlOutAddr); IO(TTL_OUT) = AR;

{ спокойненько выходим из функции													}
	RTS;
